[
    {
        "id": "1",
        "title": "Привет, мир!",
        "description": "Написать первую программу на Python",
        "videoUrl": "https://www.youtube.com/watch?v=example1",
        "videoTitle": "Python с нуля. Урок 1: Первая программа и переменные",
        "fullDescription": "Ты должен открыть установленный Python или редактор на платформе. Ты должен написать программу, которая выводит на экран фразу \"Hello, World!\" и твоё имя. Ты должен проверить, что каждая строка выводится правильно. В процессе выполнения ты должен понять, как команда print выводит текст, как текстовые строки работают с кавычками и как интерпретатор выполняет команды сверху вниз. Ты должен увидеть результат на экране, сохранить файл и убедиться, что программа работает без ошибок. В конце ты должен быть уверенным, что умеешь запускать первую программу и видеть вывод текста на экране.",
        "steps": [
            "Установить Python",
            "Открыть среду разработки или терминал",
            "Написать код: print(\"Hello, World!\") и print(\"Меня зовут <твое имя>\")",
            "Сохранить файл",
            "Запустить программу",
            "Проверить результат"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "2",
        "title": "Имя и возраст",
        "description": "Работа с вводом данных через input()",
        "videoUrl": "https://rutube.ru/video/example2",
        "videoTitle": "Изучаем Python - Ввод данных",
        "fullDescription": "Ты должен написать программу, которая спрашивает твоё имя и возраст через команду ввода. Ты должен объединить эти данные и вывести их на экран в формате: \"Тебя зовут …, тебе … лет\". Ты должен проверить, что программа корректно отображает введённые данные. Ты должен понять, как ввод от пользователя сохраняется в переменные, как работать с текстом и числами, и как соединять их в одно сообщение. Ты должен убедиться, что программа правильно выводит текст для любого введённого имени и возраста, и понимать логику обработки пользовательского ввода.",
        "steps": [
            "Спросить у пользователя имя через input()",
            "Спросить возраст",
            "Вывести фразу: 'Тебя зовут ..., тебе ... лет'",
            "Протестировать с разными данными"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "3",
        "title": "Калькулятор",
        "description": "Арифметические операции с числами",
        "videoUrl": "https://rutube.ru/video/example3",
        "videoTitle": "Изучаем Python - Арифметика",
        "fullDescription": "Ты должен написать программу, которая принимает два числа и выполняет арифметические операции: сложение, вычитание, умножение и деление. Ты должен вывести результат каждой операции. Ты должен проверить, что программа работает с любыми числами, а также обрабатывать деление на ноль. Ты должен понять, как преобразовать ввод пользователя в числа, как использовать арифметические операции и как выводить результат. В конце ты должен увидеть корректные вычисления для любых введённых чисел и понимать принцип работы калькулятора.",
        "steps": [
            "Запросить два числа от пользователя",
            "Преобразовать в float",
            "Посчитать сумму, разность, произведение и деление",
            "Вывести результаты каждой операции",
            "Протестировать с различными числами"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "4",
        "title": "Чётное или нечётное",
        "description": "Условные операторы if/else",
        "videoUrl": "https://www.youtube.com/watch?v=example4",
        "videoTitle": "Python для начинающих. Условные операторы",
        "fullDescription": "Ты должен написать программу, которая проверяет, является ли введённое число чётным или нечётным. Ты должен использовать проверку остатка от деления и условные конструкции. Ты должен вывести на экран понятное сообщение: \"Чётное\" или \"Нечётное\". Ты должен понять, как работают условия, ветвление кода и логические операторы. Ты должен протестировать программу с разными числами и убедиться, что вывод всегда правильный. В конце ты должен точно понимать, как программа принимает число и решает, чётное оно или нет.",
        "steps": [
            "Считать целое число от пользователя",
            "Проверить делимость на 2 (number % 2 == 0)",
            "Вывести 'Чётное' или 'Нечётное'",
            "Протестировать с разными числами"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "5",
        "title": "Цикл от 1 до 10",
        "description": "Работа с циклом for и range()",
        "videoUrl": "https://www.youtube.com/watch?v=example5",
        "videoTitle": "Python для начинающих. Урок 8 | Цикл for",
        "fullDescription": "Ты должен написать программу, которая выводит числа от 1 до 10. Ты должен использовать цикл for или другой подходящий цикл. Ты должен проверить, что все числа выводятся по порядку, каждое на новой строке. Ты должен понять принцип работы цикла: как повторять команды автоматически без дублирования кода. Ты должен убедиться, что цикл корректно перебирает все значения и выводит их на экран. В конце ты должен понимать, что циклы позволяют повторять действия быстро и эффективно.",
        "steps": [
            "Использовать range(1, 11)",
            "Написать цикл for",
            "Вывести каждое число в отдельной строке",
            "Проверить вывод"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "6",
        "title": "Список покупок",
        "description": "Работа со списками (list)",
        "videoUrl": "https://www.youtube.com/watch?v=example6",
        "videoTitle": "Урок по Python №7 | Списки (list)",
        "fullDescription": "Ты должен создать список из пяти предметов, например, продуктов. Ты должен вывести список на экран, проверить, что все элементы отображаются. Ты должен добавить или удалить элемент и убедиться, что список изменился. Ты должен понять, как работать со списками: добавлять элементы, удалять их и выводить на экран. В конце ты должен иметь работающий список, уметь управлять его элементами и понимать принцип хранения данных в списках.",
        "steps": [
            "Создать список покупок",
            "Вывести все элементы списка",
            "Реализовать удаление элемента по индексу",
            "Протестировать функционал"
        ],
        "difficulty": "beginner"
    },
    {
        "id": "7",
        "title": "Игра «Угадай число»",
        "description": "Циклы и условия в игровой логике",
        "videoUrl": "https://rutube.ru/video/example7",
        "videoTitle": "Изучаем Python - Циклы и условия",
        "fullDescription": "Ты должен создать программу, которая загадывает число от 1 до 20, а ты должен угадывать его, вводя числа. Ты должен получать подсказки \"больше\" или \"меньше\" после каждой попытки. Ты должен повторять ввод до тех пор, пока не угадаешь число. Ты должен понять, как работать с циклами, условиями и случайными числами. В конце ты должен успешно угадать число и убедиться, что программа корректно реагирует на каждое введённое число.",
        "steps": [
            "Импортировать random",
            "Сгенерировать случайное число от 1 до 20",
            "Создать цикл while для попыток",
            "Давать подсказки 'больше' или 'меньше'",
            "Завершить при угадывании"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "8",
        "title": "Функции",
        "description": "Создание и использование функций",
        "videoUrl": "https://www.youtube.com/watch?v=example8",
        "videoTitle": "Python для начинающих. Урок 4: Функции",
        "fullDescription": "Ты должен написать функцию, которая вычисляет квадрат числа. Ты должен передать число в функцию и вывести результат. Ты должен создать вторую функцию, которая вычисляет куб числа. Ты должен проверить обе функции с разными числами. Ты должен понять, как функции упрощают код, как использовать аргументы и возвращаемые значения. В конце ты должен видеть правильный результат и уметь использовать функции для повторяющихся задач.",
        "steps": [
            "Написать функцию square(x) для квадрата числа",
            "Написать функцию cube(x) для куба числа",
            "Запросить число у пользователя",
            "Вызвать функции и вывести результаты"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "9",
        "title": "Палиндром",
        "description": "Работа со строками и проверка палиндрома",
        "videoUrl": "https://rutube.ru/video/example9",
        "videoTitle": "Изучаем Python - Строки",
        "fullDescription": "Ты должен написать программу, которая проверяет, является ли введённая строка палиндромом. Ты должен очистить строку от пробелов и привести её к единому регистру. Ты должен вывести сообщение \"Да\" или \"Нет\". Ты должен понять, как работать со строками, как использовать срезы и сравнения. В конце ты должен убедиться, что программа правильно определяет палиндром для любого текста.",
        "steps": [
            "Спросить строку у пользователя",
            "Убрать пробелы и привести к нижнему регистру",
            "Проверить, является ли палиндромом",
            "Вывести 'Да' или 'Нет'"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "10",
        "title": "Мини-анкета",
        "description": "Сбор и форматирование данных пользователя",
        "videoUrl": "https://rutube.ru/video/example10",
        "videoTitle": "Изучаем Python - Форматирование строк",
        "fullDescription": "Ты должен создать программу, которая собирает данные: имя, возраст, хобби, любимый язык программирования. Ты должен вывести красиво оформленную анкету. Ты должен понять, как использовать несколько переменных и как объединять их в один текст. В конце ты должен увидеть корректно отображённую анкету и уметь работать с несколькими данными одновременно.",
        "steps": [
            "Спросить имя, возраст, язык программирования, хобби",
            "Сформировать красивый профиль",
            "Вывести многострочный результат",
            "Использовать f-строки для форматирования"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "11",
        "title": "Конвертер единиц",
        "description": "Преобразование единиц измерения",
        "videoUrl": "https://rutube.ru/video/example11",
        "videoTitle": "Изучаем Python - Арифметика и функции",
        "fullDescription": "Ты должен написать программу, которая переводит значения между единицами измерения (например, километры → мили, кг → фунты, °C → °F). Ты должен предоставить меню выбора, принять число, выполнить вычисления и вывести результат. Ты должен понять, как применять формулы и условия, чтобы перевод был корректным. В конце ты должен увидеть правильный результат и понимать, как программа использует пользовательский ввод и арифметику.",
        "steps": [
            "Создать меню выбора конвертера",
            "Реализовать формулы (км→мили, кг→фунты, °C→°F)",
            "Считать значение от пользователя",
            "Вывести результат конвертации"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "12",
        "title": "Сортировка списка",
        "description": "Работа с сортировкой данных",
        "videoUrl": "https://rutube.ru/video/example12",
        "videoTitle": "Изучаем Python - Списки и алгоритмы",
        "fullDescription": "Ты должен создать список чисел и отсортировать его по возрастанию. Ты должен вывести отсортированный список. Ты должен протестировать сортировку с разными числами. Ты должен понять, как работать со списками и встроенными методами сортировки. В конце ты должен видеть правильно упорядоченные данные.",
        "steps": [
            "Создать или ввести список чисел",
            "Отсортировать по возрастанию",
            "Отсортировать по убыванию",
            "Вывести результаты"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "13",
        "title": "Простой чат-бот",
        "description": "Создание бота с условной логикой",
        "videoUrl": "https://rutube.ru/video/example13",
        "videoTitle": "Изучаем Python - Условия и циклы",
        "fullDescription": "Ты должен создать программу, которая реагирует на заранее заданные фразы. Ты должен использовать условия и цикл, чтобы бот отвечал на команды пользователя. Ты должен протестировать несколько фраз и убедиться, что бот отвечает корректно. Ты должен понять, как обрабатывать ввод, условия и циклы. В конце ты должен иметь работающий чат‑бот, который реагирует на заданные команды.",
        "steps": [
            "Определить 5+ фраз для распознавания",
            "Создать бесконечный цикл",
            "Реализовать ответы на фразы",
            "Добавить выход по команде 'пока'"
        ],
        "difficulty": "intermediate"
    },
    {
        "id": "14",
        "title": "Генератор паролей",
        "description": "Генерация случайных паролей",
        "videoUrl": "https://rutube.ru/video/example14",
        "videoTitle": "Изучаем Python - Модули и библиотеки",
        "fullDescription": "Ты должен написать программу, которая создаёт случайный пароль из букв, цифр и символов. Ты должен задать длину пароля, сгенерировать его и вывести на экран. Ты должен понять, как использовать случайные данные, библиотеки и строки. В конце ты должен получить рабочий пароль и уметь изменять его длину по желанию.",
        "steps": [
            "Импортировать random и string",
            "Создать набор символов (буквы, цифры, знаки)",
            "Сгенерировать пароль заданной длины",
            "Добавить выбор длины пользователем"
        ],
        "difficulty": "advanced"
    },
    {
        "id": "15",
        "title": "Мини-проект: Моя тетрадь",
        "description": "Комплексный проект с функциями и списками",
        "videoUrl": "https://rutube.ru/video/example15",
        "videoTitle": "Изучаем Python - Полный курс",
        "fullDescription": "Ты должен создать программу для заметок, где можно добавлять, удалять, просматривать и искать заметки. Ты должен использовать функции, списки и циклы. Ты должен протестировать каждую функцию, чтобы убедиться, что работает корректно. Ты должен понять, как объединять разные элементы языка Python в один проект. В конце ты должен иметь полноценное приложение, которое позволяет управлять заметками и видеть результаты своих действий на экране.",
        "steps": [
            "Создать список для хранения заметок",
            "Написать функцию add_note()",
            "Написать функцию show_notes()",
            "Написать функцию delete_note()",
            "Написать функцию find_note()",
            "Создать меню для выбора операций",
            "Протестировать все функции"
        ],
        "difficulty": "advanced"
    }
]